# 6. 데이터 선택(기본)

In [3]:
import pandas as pd
df=pd.read_csv('score.csv')
df

    이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  채치수  북산고  197   90   85  100  95  85      Python
1  정대만  북산고  184   40   35   50  55  25        Java
2  송태섭  북산고  168   80   75   70  80  75  Javascript
3  서태웅  북산고  187   40   60   70  75  80         NaN
4  강백호  북산고  188   15   20   10  35  10         NaN
5  변덕규  능남고  202   80  100   95  85  80           C
6  황태산  능남고  188   55   65   45  40  35      PYTHON
7  윤대협  능남고  190  100   85   90  95  95          C#

## column 선택(label)

In [4]:
df['이름']

0    채치수
1    정대만
2    송태섭
3    서태웅
4    강백호
5    변덕규
6    황태산
7    윤대협
Name: 이름, dtype: object

In [5]:
df[['이름','키']]

    이름    키
0  채치수  197
1  정대만  184
2  송태섭  168
3  서태웅  187
4  강백호  188
5  변덕규  202
6  황태산  188
7  윤대협  190

column 선택 (label)

In [6]:
df.columns

Index(['이름', '학교', '키', '국어', '영어', '수학', '과학', '사회', 'SW특기'], dtype='object')

In [8]:
df.columns[0]

'이름'

In [9]:
df.columns[2]

'키'

In [10]:
df[df.columns[0]] #df['이름']과 같은 효과

0    채치수
1    정대만
2    송태섭
3    서태웅
4    강백호
5    변덕규
6    황태산
7    윤대협
Name: 이름, dtype: object

In [11]:
df[df.columns[-1]] # 맨 끝 값 가져온다

0        Python
1          Java
2    Javascript
3           NaN
4           NaN
5             C
6        PYTHON
7            C#
Name: SW특기, dtype: object

## 슬라이싱

In [12]:
df

    이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  채치수  북산고  197   90   85  100  95  85      Python
1  정대만  북산고  184   40   35   50  55  25        Java
2  송태섭  북산고  168   80   75   70  80  75  Javascript
3  서태웅  북산고  187   40   60   70  75  80         NaN
4  강백호  북산고  188   15   20   10  35  10         NaN
5  변덕규  능남고  202   80  100   95  85  80           C
6  황태산  능남고  188   55   65   45  40  35      PYTHON
7  윤대협  능남고  190  100   85   90  95  95          C#

In [13]:
df['영어'][0:5] # 0~4까지의 데이터 가져온다

0    85
1    35
2    75
3    60
4    20
Name: 영어, dtype: int64

In [15]:
df[['이름','키']][:3] # 처음 3명의 이름, 키 정보를 가져온다

    이름    키
0  채치수  197
1  정대만  184
2  송태섭  168